backend/app/controllers/api/v1/tasks_controller.rb

        def index
          # この辺りはかなり簡略化しています。
      # 本来であれば seeds.rb を作成した方が良いです...
          if Task.count.zero?
            ['1st task', '2nd task', '3rd task'].each do |title|
              Task.create!(title: title)
            end
          end
      # この辺りも本来であればきちんとシリアライズした方が良いです...
          render json: { tasks: Task.all.to_json }
---
SELECT `tasks`.* FROM `tasks`
SELECT COUNT(*) FROM `tasks`
INSERT INTO `tasks` (`title`, `created_at`, `updated_at`) VALUES ('1st task', '2023-03-25 07:09:24.188565', '2023-03-25 07:09:24.188565')